Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: མིག་སྦྱིན་མཛད་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་པར་འགྱུར། །
en: After this giver of sight has attained nirvāṇa, The relics of this victor will be abundant.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་རྒྱལ་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ལྷ་ཡིས་མཆོད་ཅེས་བྱ། །
en: “The thus-gone Devarāja Will be born in a place called Worshiped by Gods.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །སྟོང་ཁམས་གཅིག་ཙམ་ཡབ་ནི་ལྷ་བཟང་ཡིན། །ལྷ་ཡི་དབང་ཕྱུག་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend as far as a thousandfold world. “Excellent Divinity will be his father, and Ruler of Gods will be this victor’s mother.

source: སྲས་པོ་ལྷ་ཡིན་ལྷ་ནི་རིམ་གྲོ་པ། །
en: Deity will be his son and Deity his attendant.

source: ཚངས་པ་འཕགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Brahmā Superior will be the scholar

source: ལྷ་དབང་གཙོ་བོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Foremost Ruler of Gods the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །གཟུངས་ཐོབ་བྱང་ཆུབ་དག་ནི་འདོད་པ་པོ། །ཁྲི་ཕྲག་དག་ནི་དགུ་བཅུ་བཞི་བཞི་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering nine hundred forty thousand Who have attained retention and wish for awakening.

source: མི་ཚེ་ལོ་གྲངས་བྱེ་སྟོང་དགུ་བཅུ་དགུ། །
en: The lifespan of humans will be nine hundred ninety billion years,

source: བྱང་ཆུབ་ཏུ་ནི་ཡོངས་སུ་སྨིན་བྱའི་ཕྱིར། །དམ་ཆོས་ལོ་གྲངས་བརྒྱད་འབུམ་བར་དུ་གནས། །
en: “And in order to ripen beings toward awakening His sacred Dharma will remain for eight hundred thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བཟང་པོས་ཞིང་རྣམས་གང་བར་འགྱུར། །
en: The relics of this victor will be abundant, And fine stūpas will fill the realms.

source: དེ་བཞིན་གཤེགས་པ་ནོར་བུ་གསལ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་གསལ་ཞེས་བྱ། །
en: “The thus-gone Maṇiviśuddha Will be born in a place called Clear Jewels.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཁྲི་ཡོད་ཡབ་ནི་གསལ་བ་ཡིན། །རིན་ཆེན་མཆོག་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend ten thousand leagues. “Luminous will be his father, and Supreme Jewel will be this victor’s mother.

source: སྲས་པོ་དགའ་ལྡན་ལེགས་མཐོང་རིམ་གྲོ་པ། །
en: Joyous will be his son and Excellent Sight his attendant.

source: རྟག་པ་མཐོང་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Constant Seeing the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་གཉིས་ཀུན་ལའང་། །དགྲ་བཅོམ་ཟག་པ་མེད་པའི་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be sixty-two consecutive congregations, Each of them gathering seven hundred thirty million Worthy ones free from contaminants.

source: འགོག་པར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of this perfecter of cessation Will also remain for seventy-four thousand years.

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་བརྒྱ་པ་གཅིག །གསེར་དང་ནོར་བུའི་ལྡ་ལྡིས་མཛེས་པར་བྱས། །
en: His relics will reside in a single stūpa one hundred leagues large And decorated with beautiful tassels of gold and jewels.

source: དེ་བཞིན་གཤེགས་པ་ནོར་བཟང་སྐྱེ་བ་ཡི། །ཡུལ་ནི་བསོད་ནམས་རྣམ་པར་བརྒྱན་ཅེས་བྱ། །
en: “The thus-gone Sudhana Will be born in a place called Merit Adornment.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་སྟོང་རབ་ཏུ་དགེ་བ་ཡབ། །ཐར་པའི་རྒྱལ་མཚན་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend nine thousand leagues. “Highly Virtuous will be his father, and Banner of Liberation will be this victor’s mother.

source: སྲས་པོ་སྟོན་བརྩེགས་རྒྱལ་བ་རིམ་གྲོ་པ། །
en: Teacher of the Peak will be his son and Victor his attendant.

source: ཡེ་ཤེས་ང་རོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Roar of Wisdom will be the scholar

source: མཛེས་པར་གནས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Remaining in Beauty the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ངར་མི་འཛིན་པ་ཡང་སྲིད་ཟད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering three hundred twenty million Who do not perceive self but bring existence to exhaustion.

source: ནུབ་པར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སུམ་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: “And after this teacher has passed away His sacred Dharma will remain for thirty-four thousand years.

source: རྒྱལ་བ་དེ་ཡི་སྐུ་གདུང་རྒྱས་འགྱུར་ཏེ། །ཞིང་རྣམས་དག་ཏུ་རྣམ་པར་གང་བར་འགྱུར།། །།
en: His relics of this victor will be abundant, Filling all of the realms.

source: མཚུངས་པ་མེད་པ་སྒྲོན་མ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་བསོད་ནམས་སྒྲོན་མ་ཞེས་ཀྱང་བྱ། །
en: “The incomparable Pradīpa Will be born in a place called Lamp of Merit.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་སུམ་སྟོང་རྣམ་པར་གནོན་པ་ཡབ། །གཟི་བརྗིད་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend three thousand leagues. “Subjugator will be his father, and Splendid Light will be this victor’s mother.

source: སྲས་པོ་གཟི་བྱིན་སྒྲོན་མ་རིམ་གྲོ་པ། །
en: Splendid Gift will be his son and Lamp his attendant.

source: སྒྲོན་མ་བྱེད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Lamp Maker will be the scholar

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་དེ་དག་ཚོགས་པར་འགྱུར་བའི་གྲངས། །བདུན་འབུམ་བདུན་འབུམ་དག་ནི་འདུས་པར་འགྱུར། །
en: “There will be seventy consecutive congregations, Each of them gathering Seven hundred thousand worthy ones.

source: འཇིག་རྟེན་ཕན་ཕྱིར་སྐུ་གདུང་རྒྱས་འགྱུར་ལ། །རིན་ཆེན་བརྒྱ་ཡི་དྲ་བས་རྣམ་པར་སྤྲས། །
en: In order to benefit the world, his relics will be abundant And adorned with nets of hundreds of jewels.

source: རྒྱལ་བ་རིན་ཆེན་ང་རོ་དབྱངས་དག་གི །སྐྱེ་བའི་ཡུལ་ནི་དབྱངས་དང་ལྡན་ཞེས་བྱ། །
en: “The victorious Ratna­svara­ghoṣa Will be born in a place called Endowed with Melody.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་སྟོང་ཡབ་ནི་ལྷ་ལུས་ཡིན། །རིན་ཆེན་འགྲོས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend one hundred thousand leagues. “Divine Body will be his father, and Jewel Mode will be this victor’s mother.

source: སྲས་པོ་རྒྱལ་བྱིན་རྒལ་གྱུར་རིམ་གྲོ་པ། །
en: Royal Gift will be his son and Traverser his attendant.

source: ང་རྒྱལ་བཅད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Eliminator of Pride will be the scholar

source: ཉོན་མོངས་གསལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Dispeller of Defilements the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཚུལ་བཞིན་ཆོས་ཀྱི་ཕ་རོལ་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering eight hundred twenty million Who correctly perfect the Dharma.

source: མི་ཚེ་ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས། །
en: The lifespan of humans will be eighty thousand years,

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་བརྒྱད་པ་གཅིག །རིན་ཆེན་བྱེ་བ་དག་གིས་རབ་ཏུ་བརྒྱན། །
en: His relics will reside in a single stūpa Eight leagues large and decorated with millions of jewels.

source: རྒྱལ་བ་སྐྱེ་དབང་རྒྱལ་པོ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་དྲག་ཤུལ་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: “The victorious Janendrarāja Will be born in a place called Fierce Illumination.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ཁྱད་པར་འཕགས། །རྒྱ་མཚོའི་བློ་གྲོས་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend one hundred leagues. “Distinguished will be his father, and Ocean Intelligence will be this victor’s mother.

source: སྲས་པོ་རྒྱ་མཚོ་མཚོ་ཆེན་རིམ་གྲོ་པ། །
en: Ocean will be his son and Great Ocean his attendant.

source: བདུད་རྩི་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Nectar Joy will be the scholar

source: མྱ་ངན་འདས་པའི་སྟེགས་བཟང་རྫུ་འཕྲུལ་ཅན། །
en: And Excellent Steps to Nirvāṇa the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་གཉིས་ཀུན་ལའང་། །དངོས་མེད་ཕྱིན་པ་གཏི་མུག་མེད་ཞི་བ། །བྱེ་བ་ཕྲག་ནི་དྲུག་ཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be sixty-two consecutive congregations, Each of them gathering six hundred thirty million Serene ones who have gone beyond entities and are undeluded.

source: དྲི་མ་སྤངས་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དྲུག་ཁྲི་ཆིག་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of the one who has given up the stains Will also remain for sixty-one thousand years.

source: དེ་བཞིན་གཤེགས་པ་སྒྲ་གཅན་སྦེད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སྒྲོན་མའི་མདངས་ཞེས་བྱ། །
en: “The thus-gone Rāhugupta Will be born in a place called Bright Lamp.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ཡོན་ཏན་འཕྲུལ། །རྫུ་འཕྲུལ་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend ten leagues. “Miraculous Qualities will be his father, and Miraculous Light will be this victor’s mother.

source: སྲས་པོ་འཕྲུལ་ཅན་བཀོད་པ་རིམ་གྲོ་པ། །
en: Endowed with Miracles will be his son and Array his attendant.

source: བློ་དང་ལྡན་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Intelligent will be the scholar

source: འཁྲུལ་པ་མེད་པར་སེམས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Intent on Freedom from Delusion the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་ཐམས་ཅད་ཟག་པ་མེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་ཉི་ཤུ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering two hundred million Worthy ones who are free from all contaminants.

source: འགོག་པར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་ཉི་ཁྲི་ཆིག་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of the one who has gone to cessation Will also remain for twenty-one thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བདུན་པ་རིན་པོ་ཆེ་ཡིས་སྤྲས། །
en: The relics of this victor will reside in a single stūpa Seven leagues large and studded with jewels.

source: འཇིག་རྟེན་མགོན་པོ་དགེ་བ་མཛད་པ་ཡི། །སྐྱེ་ཡུལ་གཟི་བརྗིད་འཇིགས་པ་མེད་ཅེས་བྱ། །
en: “The protector of the world, Kṣemaṃkara, Will be born in a place called Fearless Splendor.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཅུ་ཡབ་ནི་དོན་བརྟན་ཡིན། །མཆོག་ཏུ་བརྟན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend sixty leagues. “Stable Meaning will be his father, and Supreme Steadfastness will be this victor’s mother.

source: སྲས་པོ་ཁ་སྒྱུར་དྲང་པོ་རིམ་གྲོ་པ། །
en: Leader will be his son and Earnest his attendant.

source: ཡོན་ཏན་ཆེ་ཕྲ་འཛིན་པ་མཁས་པ་སྟེ། །
en: Holder of Subtle Qualities will be the scholar

source: སྒྲོན་མ་གནས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Abiding Lamp the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །འཇིག་རྟེན་དད་པ་དགྲ་བཅོམ་ཆགས་མེད་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: “There will be ninety consecutive congregations, Each of them gathering nine hundred ninety million Worthy ones who instill faith in the world and are free from attachment.

source: སྣང་བ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of the one who has gone beyond appearance Will remain for ninety thousand years.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་བློ་གྲོས་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་མདངས་སྣང་བྱེད་ཅེས་བྱ། །
en: “The thus-gone Siṃhamati Will be born in a place called Shining Brightness.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ཡིད་འོང་ཡིན། །ལྷ་དགའ་ཞེས་ནི་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend nine leagues. “Delightful will be his father, and Divine Joy will be this victor’s mother.

source: སྲས་པོ་སྟོན་བྱེད་མཛེས་ཅན་རིམ་གྲོ་པ། །
en: Teacher will be his son and Endowed with Beauty his attendant.

source: དད་པར་བྱེད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Instiller of Faith the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་ཀུན་ལ་ཡང་། །ལྷ་ཡི་གནས་པའི་ཕ་རོལ་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་དྲུག་དྲུག་ཡོད། །
en: “There will be thirty consecutive congregations, Each of them gathering three hundred sixty million Who go beyond the divine abodes.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ནི། །བཅུ་གཅིག་པ་གཅིག་གསེར་གྱི་བླ་རེར་ལྡན། །རིན་ཆེན་མཆོག་མ་བྱེ་བས་རྣམ་པར་སྤྲས། །
en: The stūpa containing the relics of this victor Will be eleven leagues large, covered with golden canopies And studded with ten million supreme jewels.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གྲགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་གསེར་གྱི་སྒྲོན་ཞེས་བྱ། །
en: “The thus-gone Ratnayaśas Will be born in a place called Golden Lamp.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་གསུམ་ཡབ་ནི་ལྷ་བཟང་ཡིན། །སྙན་པར་གྲགས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend thirteen leagues. “Excellent Divinity will be his father, and Fame will be this victor’s mother.

source: སྲས་པོ་ལེགས་འོངས་བློ་ལྡན་རིམ་གྲོ་པ། །
en: Excellent Arrival will be his son and Intelligent his attendant.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་གཅིག་ཀུན་ལའང་། །ཐམས་ཅད་གནས་པ་མེད་པའི་ལམ་ཐོབ་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: “There will be ninety-one consecutive congregations, Each of them gathering nine hundred ninety million Who have attained the nonabiding path.

source: ཆགས་པ་མེད་པར་གྱུར་པའི་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲི་དགུ་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of the one free from attachment Will also remain for ninety-nine thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ཞིང་རྣམས་ཀུན་དུ་མཆོད་རྟེན་བཟང་པོས་གང་། །
en: The relics of this victor will be abundant, And all realms will be filled with fine stūpas.

source: སེམས་ཅན་སྙིང་པོ་དོན་ནི་མཛད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ལྷ་ཡིས་བཀོད་ཅེས་བྱ། །
en: “The heart of sentient beings, Kṛtārtha, Will be born in a place called Arranged by Gods.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ལྔ་བརྒྱ་ཡབ་ནི་སྤོང་པ་ཡིན། །གྲགས་ཏོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend five hundred leagues. “Abandonment will be his father, and Crest of Fame will be this victor’s mother.

source: སྲས་པོ་བྱང་ཆུབ་ཆོས་ལྡན་རིམ་གྲོ་པ། །
en: Awakening will be his son and Endowed with Dharma his attendant.

source: ཡོན་ཏན་གནས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Abode of Qualities will be the scholar

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་དག་ཆོམས་པ་དེ་དག་འདུས་པའི་གྲངས། །བྱེ་བ་ཕྲག་ནི་འབུམ་འབུམ་འདུས་པར་འགྱུར། །
en: “There will be eighty consecutive congregations, Each of them gathering worthy ones Numbering one trillion.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ནི། །བཅུ་གཉིས་པ་གཅིག་གསེར་གྱི་བླ་རེར་ལྡན། །
en: The stūpa containing the relics of this victor Will be twelve leagues large and adorned with golden canopies.

source: དེ་བཞིན་གཤེགས་པ་མཛད་མཐའ་གཟིགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མཛེས་པར་སྦྱངས་ཞེས་བྱ། །
en: “The thus-gone Kṛtāntadarśin Will be born in a place called Beautifully Purified.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཅུ་རྣམ་པར་དག་པ་ཡབ། །བྱས་པ་ངེས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend sixty leagues. “Purity will be his father, and Certain Accomplishment will be this victor’s mother.

source: སྲས་པོ་བཟང་ལྡན་གྲགས་བྱིན་རིམ་གྲོ་པ། །
en: Endowed with Excellence will be his son and Fame Gift his attendant.

source: མཆོད་རྟེན་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Stūpa of Joy will be the scholar

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་དག་ཆོམས་པ་དེ་དག་ཀུན་གྱི་གྲངས། །བྱེ་བ་ཕྲག་ནི་བརྒྱ་བརྒྱ་འདུས་པར་འགྱུར། །
en: “There will be eighty consecutive congregations, Each of them gathering worthy ones Numbering one billion.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །སྟོང་གསུམ་མཆོད་རྟེན་བཟང་པོས་གང་བར་འགྱུར། །
en: The relics of this victor will be abundant, And fine stūpas will fill the trichiliocosm.

source: དེ་བཞིན་གཤེགས་པ་སྲིད་པའི་མེ་ཏོག་གི། །སྐྱེ་བའི་ཡུལ་ནི་གྲགས་པ་བསྒྲགས་ཞེས་བྱ། །
en: “The thus-gone Bhavapuṣpa Will be born in a place called Proclamation of Fame.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་ལྔ་ཡབ་ནི་སྲིད་མཐའ་ཡིན། །བློ་གྲོས་ཉི་མ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend thirty-five leagues. “Limit of Existence will be his father, and Sun of Intelligence will be this victor’s mother.

source: ནོར་ལྷའི་བུ་སྲས་ཟླ་ཉི་རིམ་གྲོ་པ། །དགྲ་བཅོམ་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Child of the Wealth God will be his son and Moon and Sun his attendant. Joy of the Worthy Ones will be the scholar

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ང་མེད་ནམ་མཁའ་དག་དང་མཚུངས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་བཞི་བཞི་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering eight hundred forty million Who are equal to space in lacking an ‘I.’

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་ཆིག་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has attained parinirvāṇa His sacred Dharma will remain for twenty-one thousand years.

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་བཅུ་གསུམ་པ། །གཅིག་སྟེ་རིན་ཆེན་བཀོད་པས་རབ་ཏུ་བརྒྱན། །
en: The relics of this victor will reside in a single stūpa Thirteen leagues large and adorned with arrays of jewels.

source: འཇིག་རྟེན་མགོན་པོ་མཛོད་སྤུ་ལྡན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སྟེགས་མཆོག་ཅེས་ཀྱང་བྱ། །
en: “The protector of the world, Ūrṇa, Will be born in a place called Supreme Steps.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གསུམ་ཡབ་ནི་རབ་གསལ་ཡིན། །བརྟུལ་ཞུགས་གྲུབ་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend thirty-three leagues. “Highest Clarity will be his father, and Accomplishment of Yogic Discipline will be this victor’s mother.

source: སྲས་པོ་ཟླ་སྡུག་རབ་དགའ་རིམ་གྲོ་པ། །
en: Delightful Moon will be his son and Highest Joy his attendant.

source: ཐར་པའི་འགྲོས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Mode of Liberation will be the scholar

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་དྲུག་ཀུན་ལའང་། །རི་ཡི་རྒྱལ་པོ་ལྟ་བུར་མི་གཡོ་བ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གསུམ་གསུམ་ཡོད། །
en: “There will be twenty-six consecutive congregations, Each of them gathering two hundred thirty million Who are immutable, like the king of mountains.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has attained parinirvāṇa His sacred Dharma will also remain for twenty-two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་བརྒྱད་ཅུ་བྱུང་། །
en: The relics of this victor will be abundant, And there will appear eight hundred billion stūpas.

source: སངས་རྒྱས་སྤོབས་པ་མཚུངས་མེད་རྒྱལ་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སྣ་ཚོགས་མཛེས་ཞེས་བྱ། །
en: “The buddha Atula­pratibhāna­rāja Will be born in a place called Diverse Beauty.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཞི་བཅུ་ཡབ་ནི་སྐྱོན་མེད་ཡིན། །ཡོན་ཏན་མཐོང་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend forty leagues. “Flawless will be his father, and Seeing Qualities will be this victor’s mother.

source: ཡོན་ཏན་ཅན་སྲས་བློ་ལྡན་རིམ་གྲོ་པ། །
en: Possessor of Qualities will be his son and Endowed with Wisdom his attendant.

source: རྒྱལ་མཚན་མཆོག་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Supreme Banner will be the scholar

source: ནོར་ལྷའི་བུ་ཏོག་ཅེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Crest of the Child of the Wealth God the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །ཆུ་དང་ནམ་མཁའ་ལྟ་བུར་གསལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be ninety consecutive congregations, Each of them gathering nine hundred twenty million Who are clear like water or the sky.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲི་ཆིག་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has attained parinirvāṇa His sacred Dharma will remain for ninety-one thousand years.

source: འགྲོ་ལ་ཕན་ཕྱིར་རྒྱལ་བའི་སྐུ་གདུང་དག །རྒྱས་པར་འགྱུར་ཏེ་ཞིང་རྣམས་གང་བར་འགྱུར། །
en: For the benefit of wandering beings, the relics of this victor Will be abundant, filling the realms.

source: སངས་རྒྱས་ཡེ་ཤེས་རྣམ་འབྱེད་ང་རོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རྣམ་གྲགས་ལྷ་ཞེས་བྱ། །
en: “The buddha Vibhakta­jñā­svara Will be born in a place called Famed Divinity.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་ངོས་བཟངས་ཡིན། །མཚན་ལྡན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend twenty-two leagues. “Fine Face will be his father, and Authentic will be this victor’s mother.

source: བསོད་ནམས་འདོད་སྲས་གཙོ་བོ་རིམ་གྲོ་པ། །
en: Wish for Merit will be his son and Leader his attendant.

source: བརྟུལ་ཞུགས་གྲུབ་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Accomplishment of Yogic Discipline will be the scholar

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་གསུམ་ཀུན་ལའང་། །དྲི་བྲལ་འཇིག་རྟེན་དྲི་མའི་དྲི་མེད་པ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be thirty-three consecutive congregations, Each of them gathering three hundred twenty million Immaculate ones free from the stains of the world.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་སུམ་ཁྲི་ཆིག་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has attained parinirvāṇa His sacred Dharma will remain for thirty-one thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ནི། །དྲུག་ཅུ་པ་གཅིག་གསེར་གྱི་བླ་རེར་ལྡན། །
en: The relics of this victor will reside in a single stūpa Sixty leagues large and adorned with golden canopies.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་མཆེ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བྲོ་བའི་མཆོག་ཅེས་བྱ། །
en: “The thus-gone Siṃhadaṃṣṭra Will be born in a place called Supreme Fragrance.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བྱེ་བ་ཕྲག་གསུམ་གླང་ཆེན་དབང་པོ་ཡབ། །ཐར་པའི་དབྱངས་ནི་རྒྱལ་ཡུམ་ལྟ་བྱེད་སྲས། །ན་ཚོད་བཟང་པོ་ཞེས་བྱ་རིམ་གྲོ་པ། །
en: His family will be kṣatriya, And his light will extend thirty million leagues. “Elephant Ruler will be his father and Melody of Liberation will be this victor’s mother. Eye will be his son and Excellent Youth his attendant.

source: རྣམ་པར་གྲོལ་བའི་བཀོད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Liberated Array the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་ཀུན་ལ་ཡང་། །སྤྱོད་པ་འཁྲུལ་པ་མེད་པར་གྱུར་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དྲུག་ཅུ་བདུན་བདུན་ཡོད། །
en: “There will be sixty consecutive congregations, Each of them gathering six hundred seventy million Whose conduct is free from delusion.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་དྲུག་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And when this teacher has attained parinirvāṇa His sacred Dharma will remain for sixty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ཏེ། །ཞིང་རྣམས་མཆོད་རྟེན་དག་གིས་གང་བར་འགྱུར། །
en: The relics of this victor will be abundant, And fine stūpas will fill the realms.

source: དེ་བཞིན་གཤེགས་པ་མཛེས་པར་གཤེགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བདེན་པ་གསལ་ཞེས་བྱ། །
en: “The thus-gone Laḍitagāmin Will be born in a place called Clear Truth.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །དགུ་བཅུ་རྩ་བཞི་ཡབ་ནི་བཀོད་པ་ཡིན། །གཟི་བརྗིད་ཆེན་མོ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend ninety-four leagues. “Array will be his father, and Great Splendor will be this victor’s mother.

source: སྲས་པོ་དེས་པ་བཟང་པོ་རིམ་གྲོ་པ། །
en: Gentle will be his son and Excellent his attendant.

source: ཡིད་འཇམ་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Loving Mind will be the scholar

source: བྱང་ཆུབ་དྲང་པོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Earnest Awakening the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་ལྔ་ཀུན་ལའང་། །ལེགས་དུལ་ཡིད་ལྡན་གླང་པོ་འདྲ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: “There will be twenty-five consecutive congregations, Each of them gathering nine hundred ninety million Elephant-like meditators whose minds are well trained.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བཞི་པ་བཀོད་པ་ཡིད་དུ་འོང་། །
en: The relics of this victor will reside in a single stūpa Four leagues large and beautifully decorated.

source: དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་སྒྲོན་མ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སྒྲོན་མའི་ཏོག་ཅེས་བྱ། །
en: “The thus-gone Puṇyapradīpa Will be born in a place called Crest Lamp.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ལྷ་བཟང་ཡིན། །གྲགས་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend ten leagues. “Excellent Divinity will be his father, and Supreme Fame will be this victor’s mother.

source: སྲས་པོ་འཕྲུལ་ཅན་མཐུ་རྩལ་རིམ་གྲོ་པ། །
en: Possessor of Miraculous Power will be his son and Powerful his attendant.

source: མཆོད་རྟེན་གྲགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Famed Stūpa will be the scholar

source: གཟུངས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And King of Retention the one of miracles.
